In [1]:
import pandas as pd

In [2]:
expenses = pd.read_csv('expenses.csv', delimiter = ',')

Convert string values of "amount" to integers, just in case

In [3]:
expenses['amount'] = expenses['amount'].astype(int)

In [4]:
expenses.tail()

            date   category      description  amount
1333  2020-12-30  household       toothpaste     200
1334  2020-12-31       junk  white chocolate     100
1335  2020-12-31  household          shampoo     200
1336  2020-12-31       junk        chocolate     120
1337  2020-12-31       food         potatoes      60

In [5]:
total_expenses = expenses['amount'].sum()
f'Total expenses: {total_expenses:,}₽'

'Total expenses: 947,840₽'

Expenses each month

In [6]:
expenses['date'] = pd.to_datetime(expenses['date'])
expenses.groupby(pd.Grouper(key='date', freq='M')).sum()

            amount
date
2020-01-31   71470
2020-02-29   75900
2020-03-31   82500
2020-04-30   78530
2020-05-31   90100
2020-06-30   81220
2020-07-31   69120
2020-08-31   86040
2020-09-30   85870
2020-10-31   78210
2020-11-30   77040
2020-12-31   71840

Expenses for each category over the whole period

In [7]:
by_category = expenses.groupby(['category']).sum()
by_category.sort_values(by='amount', ascending=False)

           amount
category
bills      570000
clothing   150000
health      81000
food        76790
household   40490
junk        29560

Extract "Junk" category items as a separate dataframe

In [8]:
junk = expenses.loc[expenses['category'] == 'junk']
junk.tail()

           date category      description  amount
1326 2020-12-29     junk            latte     110
1331 2020-12-30     junk           coffee     110
1332 2020-12-30     junk            bepis      60
1334 2020-12-31     junk  white chocolate     100
1336 2020-12-31     junk        chocolate     120

Get sum for each unique description in the *Junk* category, rename columns for clarity

In [9]:
junked = junk.groupby(['description']).agg({'description': 'count', 'amount': 'sum'})
junked.columns = ['item count', 'amount']

Most costly items in the "Junk" category

In [10]:
junked.sort_values(by='amount', ascending=False).head()

                 item count  amount
description
latte                    30    3300
dark chocolate           23    2760
coffee                   24    2640
chips                    22    2200
white chocolate          22    2200

Sort by item count (frequency of buying)

In [11]:
junked.sort_values(by='item count', ascending=False).head()

                       item count  amount
description
latte                          30    3300
yet another ice cream          25    1500
coffee                         24    2640
dark chocolate                 23    2760
chips                          22    2200

Sort descriptions alphabetically

In [12]:
junked.sort_values(by='description')

                       item count  amount
description
americano                      22    1980
another cookies                13    1040
another ice cream              22    1760
bepis                          13     780
cake                           20    2000
candy bar                      18     900
chewing gum                    16     640
chips                          22    2200
chocolate                      16    1920
coffee                         24    2640
cookies                        16    1280
dark chocolate                 23    2760
ice cream                       9     900
latte                          30    3300
takeaway coffee                16    1760
white chocolate                22    2200
yet another ice cream          25    1500